# Задача 34: Винни-Пух попросил Вас посмотреть, есть ли в его стихах ритм. Поскольку
# разобраться в его кричалках не настолько просто, насколько легко он их придумывает, Вам
# стоит написать программу. Винни-Пух считает, что ритм есть, если число слогов (т.е. число
# гласных букв) в каждой фразе стихотворения одинаковое. Фраза может состоять из одного
# слова, если во фразе несколько слов, то они разделяются дефисами. Фразы отделяются друг
# от друга пробелами. Стихотворение Винни-Пух вбивает в программу с клавиатуры. В ответе
# напишите “Парам пам-пам”, если с ритмом все в порядке и “Пам парам”, если с ритмом все не
# в порядке
# Ввод: 
# пара-ра-рам рам-пам-папам па-ра-па-дам
# Вывод:
# Парам пам-пам

vowels = 'аоуыиэяюеё'

def rhythm(poem):
    list = []
    for word in poem:
        vowel_sum = 0
        for letter in word:
            if letter in vowels:
                vowel_sum += 1
        list.append(vowel_sum)
    return len(list) == list.count(list[0])

poem = input('Введите часть стиха: ').lower().split()

if rhythm(poem): 
    print('Парам пам-пам')
else:
    print('Пам парам')





